austinawolf/NRF52_SDK_14.3/projects/ble_motion/ble_app_motion_c/main.c
/**@brief Function for disabling the use of whitelist for scanning.
 */
static void whitelist_disable(void)
{
    if (!m_whitelist_disabled)
    {
        NRF_LOG_INFO("Whitelist temporarily disabled.");
        m_whitelist_disabled = true;
        (void) sd_ble_gap_scan_stop();
        scan_start();
    }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    ret_code_t err_code;

    switch (event)
    {
        case BSP_EVENT_SLEEP:
            nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
            break;

        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            whitelist_disable();
            break;

        default:
            break;
    }
}


/**@brief Heart Rate Collector Handler.
 */
static void motion_c_evt_handler(ble_motion_c_t * p_motion_c, ble_motion_c_evt_t * p_motion_c_evt)
{
    ret_code_t err_code;

    switch (p_motion_c_evt->evt_type)
    {
        case BLE_MOTION_C_EVT_DISCOVERY_COMPLETE:
        {
            NRF_LOG_DEBUG("Quaternion Orientation service discovered.");

            err_code = ble_motion_c_handles_assign(p_motion_c,
                                                p_motion_c_evt->conn_handle,
                                                &p_motion_c_evt->params.peer_db);
            APP_ERROR_CHECK(err_code);

            // Initiate bonding.
            err_code = pm_conn_secure(p_motion_c_evt->conn_handle, false);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }

            // Heart rate service discovered. Enable notification of Heart Rate Measurement.
            err_code = ble_motion_c_motionm_notif_enable(p_motion_c);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_MOTION_C_EVT_MOTIONM_NOTIFICATION:
        {

			/*
			switch (p_motion_c_evt->params.motionm.data_flags) {
					
				
				case (COMPASS_PACKET_FLAG):
					printf ("Compass RX\n\r");
					
					compass[0] = p_motion_c_evt->params.motionm.motion_data.compass.compass[0];
					compass[1] = p_motion_c_evt->params.motionm.motion_data.compass.compass[1];
					compass[2] = p_motion_c_evt->params.motionm.motion_data.compass.compass[2];
									
				case (IMU_PACKET_FLAG):
					printf ("IMU RX\n\r");
					accel[0] = p_motion_c_evt->params.motionm.motion_data.imu.accel[0];
					accel[1] = p_motion_c_evt->params.motionm.motion_data.imu.accel[1];
					accel[2] = p_motion_c_evt->params.motionm.motion_data.imu.accel[2];
					gyro[0] = p_motion_c_evt->params.motionm.motion_data.imu.gyro[0];
					gyro[1] = p_motion_c_evt->params.motionm.motion_data.imu.gyro[1];
					gyro[2] = p_motion_c_evt->params.motionm.motion_data.imu.gyro[2];
				
				case (QUAT_PACKET_FLAG):
					printf ("Quat RX\n\r");
					
					quat[0] = p_motion_c_evt->params.motionm.motion_data.quat.q[0];
					quat[1] = p_motion_c_evt->params.motionm.motion_data.quat.q[1];
					quat[2] = p_motion_c_evt->params.motionm.motion_data.quat.q[2];
					quat[3] = p_motion_c_evt->params.motionm.motion_data.quat.q[3];
							
					memset(quat, 0, 16);
					memset(accel, 0, 6);
					memset(gyro, 0, 6);
					memset(compass, 0, 6);	
		
				
					
			}
			*/
			 
			
        } break;

        default:
            break;
    }
}


/**@brief Battery level Collector Handler.
 */
static void bas_c_evt_handler(ble_bas_c_t * p_bas_c, ble_bas_c_evt_t * p_bas_c_evt)
{
    ret_code_t err_code;

    switch (p_bas_c_evt->evt_type)
    {
        case BLE_BAS_C_EVT_DISCOVERY_COMPLETE:
        {
            err_code = ble_bas_c_handles_assign(p_bas_c,
                                                p_bas_c_evt->conn_handle,
                                                &p_bas_c_evt->params.bas_db);
            APP_ERROR_CHECK(err_code);

            // Initiate bonding.
            err_code = pm_conn_secure(p_bas_c_evt->conn_handle, false);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }

            // Batttery service discovered. Enable notification of Battery Level.
            NRF_LOG_DEBUG("Battery Service discovered. Reading battery level.");

            err_code = ble_bas_c_bl_read(p_bas_c);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_DEBUG("Enabling Battery Level Notification.");
            err_code = ble_bas_c_bl_notif_enable(p_bas_c);
            APP_ERROR_CHECK(err_code);

        } break;

        case BLE_BAS_C_EVT_BATT_NOTIFICATION:
            NRF_LOG_INFO("Battery Level received %d %%.", p_bas_c_evt->params.battery_level);
            break;

        case BLE_BAS_C_EVT_BATT_READ_RESP:
            NRF_LOG_INFO("Battery Level Read as %d %%.", p_bas_c_evt->params.battery_level);
            break;

        default:
            break;
    }
}


/**
 * @brief Heart rate collector initialization.
 */
static void motion_c_init(void)
{
    ble_motion_c_init_t motion_c_init_obj;

    motion_c_init_obj.evt_handler = motion_c_evt_handler;

    ret_code_t err_code = ble_motion_c_init(&m_motion_c, &motion_c_init_obj);
    APP_ERROR_CHECK(err_code);
}


/**
 * @brief Battery level collector initialization.
 */
static void bas_c_init(void)
{
    ble_bas_c_init_t bas_c_init_obj;

    bas_c_init_obj.evt_handler = bas_c_evt_handler;

    ret_code_t err_code = ble_bas_c_init(&m_bas_c, &bas_c_init_obj);
    APP_ERROR_CHECK(err_code);
}


/**
 * @brief Database discovery collector initialization.
 */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Retrieve a list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size)
{
    pm_peer_id_t peer_id;
    uint32_t     peers_to_copy;

    peers_to_copy = (*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ?
                     *p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    *p_size = 0;

    while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--))
    {
        p_peers[(*p_size)++] = peer_id;
        peer_id = pm_next_peer_id_get(peer_id);
    }
}


static void whitelist_load()
{
    ret_code_t   ret;
    pm_peer_id_t peers[8];
    uint32_t     peer_cnt;

    memset(peers, PM_PEER_ID_INVALID, sizeof(peers));
    peer_cnt = (sizeof(peers) / sizeof(pm_peer_id_t));

    // Load all peers from flash and whitelist them.
    peer_list_get(peers, &peer_cnt);

    ret = pm_whitelist_set(peers, peer_cnt);
    APP_ERROR_CHECK(ret);

    // Setup the device identies list.
    // Some SoftDevices do not support this feature.
    ret = pm_device_identities_list_set(peers, peer_cnt);
    if (ret != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(ret);
    }
}


/**@brief Function to start scanning.
 */
static void scan_start(void)
{
    if (nrf_fstorage_is_busy(NULL))
    {
        m_memory_access_in_progress = true;
        return;
    }

    // Whitelist buffers.
    ble_gap_addr_t whitelist_addrs[8];
    ble_gap_irk_t  whitelist_irks[8];

    memset(whitelist_addrs, 0x00, sizeof(whitelist_addrs));
    memset(whitelist_irks,  0x00, sizeof(whitelist_irks));

    uint32_t addr_cnt = (sizeof(whitelist_addrs) / sizeof(ble_gap_addr_t));
    uint32_t irk_cnt  = (sizeof(whitelist_irks)  / sizeof(ble_gap_irk_t));

